; domain
(define (domain drone-domain)


(:requirements :strips :typing )


(:types
    person crate food medicine location drone - object
)


(:predicates
    (at ?o - object ?l - location)
    (crate-content ?b - crate ?content - object)
    (person-needs ?p - person ?content - object)
    (person-has ?p - person ?content - object)
    (arm1-free ?d - drone)
    (arm1-load ?d - drone ?b - crate)
    (arm2-free ?d - drone)
    (arm2-load ?d - drone ?b - crate)
)


(:action move-drone
    :parameters (
        ?drone - drone ?origin - location ?destination - location 
    )
    :precondition (and 
        (at ?drone ?origin)
    )
    :effect (and 
        (not (at ?drone ?origin))
        (at ?drone ?destination)
    )
)

(:action grab-arm1
    :parameters (
        ?d - drone ?b - crate ?l - location
    )
    :precondition (and 
        (at ?d ?l)
        (at ?b ?l)
        (arm1-free ?d)
    )
    :effect (and 
        (not (arm1-free ?d))
        (arm1-load ?d ?b)
        (not (at ?b ?l))
    )
)

(:action grab-arm2
    :parameters (
        ?d - drone ?b - crate ?l - location
    )
    :precondition (and 
        (at ?d ?l)
        (at ?b ?l)
        (arm2-free ?d)
    )
    :effect (and 
        (not (arm2-free ?d))
        (arm2-load ?d ?b)
        (not (at ?b ?l))
    )
)

(:action deliver-arm1
    :parameters (
        ?d - drone ?p - person ?b - crate ?content - object ?l - location
    )
    :precondition (and 
        (arm1-load ?d ?b)
        (at ?d ?l)
        (at ?p ?l)
        (crate-content ?b ?content)
        (person-needs ?p ?content)
    )
    :effect (and 
        (not (arm1-load ?d ?b))
        (arm1-free ?d)
        (not (person-needs ?p ?content))
        (person-has ?p ?content)
    )
)

(:action deliver-arm2
    :parameters (
        ?d - drone ?p - person ?b - crate ?content - object ?l - location
    )
    :precondition (and 
        (arm2-load ?d ?b)
        (at ?d ?l)
        (at ?p ?l)
        (crate-content ?b ?content)
        (person-needs ?p ?content)
    )
    :effect (and 
        (not (arm2-load ?d ?b))
        (arm2-free ?d)
        (not (person-needs ?p ?content))
        (person-has ?p ?content)
    )
)


)

; problem
(define (problem drone_problem_d1_r0_l26_p26_c26_g26_ct2)
(:domain drone-domain)
(:objects
	drone1 - drone
	depot - location
	loc1 - location
	loc2 - location
	loc3 - location
	loc4 - location
	loc5 - location
	loc6 - location
	loc7 - location
	loc8 - location
	loc9 - location
	loc10 - location
	loc11 - location
	loc12 - location
	loc13 - location
	loc14 - location
	loc15 - location
	loc16 - location
	loc17 - location
	loc18 - location
	loc19 - location
	loc20 - location
	loc21 - location
	loc22 - location
	loc23 - location
	loc24 - location
	loc25 - location
	loc26 - location
	crate1 - crate
	crate2 - crate
	crate3 - crate
	crate4 - crate
	crate5 - crate
	crate6 - crate
	crate7 - crate
	crate8 - crate
	crate9 - crate
	crate10 - crate
	crate11 - crate
	crate12 - crate
	crate13 - crate
	crate14 - crate
	crate15 - crate
	crate16 - crate
	crate17 - crate
	crate18 - crate
	crate19 - crate
	crate20 - crate
	crate21 - crate
	crate22 - crate
	crate23 - crate
	crate24 - crate
	crate25 - crate
	crate26 - crate
	food - contents
	medicine - contents
	person1 - person
	person2 - person
	person3 - person
	person4 - person
	person5 - person
	person6 - person
	person7 - person
	person8 - person
	person9 - person
	person10 - person
	person11 - person
	person12 - person
	person13 - person
	person14 - person
	person15 - person
	person16 - person
	person17 - person
	person18 - person
	person19 - person
	person20 - person
	person21 - person
	person22 - person
	person23 - person
	person24 - person
	person25 - person
	person26 - person
)
(:init
	(at drone1 depot)
	(arm1-free drone1)
	(arm2-free drone1)
	(at crate1 depot)
	(at crate2 depot)
	(at crate3 depot)
	(at crate4 depot)
	(at crate5 depot)
	(at crate6 depot)
	(at crate7 depot)
	(at crate8 depot)
	(at crate9 depot)
	(at crate10 depot)
	(at crate11 depot)
	(at crate12 depot)
	(at crate13 depot)
	(at crate14 depot)
	(at crate15 depot)
	(at crate16 depot)
	(at crate17 depot)
	(at crate18 depot)
	(at crate19 depot)
	(at crate20 depot)
	(at crate21 depot)
	(at crate22 depot)
	(at crate23 depot)
	(at crate24 depot)
	(at crate25 depot)
	(at crate26 depot)
	(crate-content crate1 food)
	(crate-content crate2 food)
	(crate-content crate3 food)
	(crate-content crate4 food)
	(crate-content crate5 food)
	(crate-content crate6 food)
	(crate-content crate7 food)
	(crate-content crate8 food)
	(crate-content crate9 food)
	(crate-content crate10 food)
	(crate-content crate11 food)
	(crate-content crate12 food)
	(crate-content crate13 food)
	(crate-content crate14 food)
	(crate-content crate15 food)
	(crate-content crate16 food)
	(crate-content crate17 food)
	(crate-content crate18 food)
	(crate-content crate19 medicine)
	(crate-content crate20 medicine)
	(crate-content crate21 medicine)
	(crate-content crate22 medicine)
	(crate-content crate23 medicine)
	(crate-content crate24 medicine)
	(crate-content crate25 medicine)
	(crate-content crate26 medicine)
	(at person1 loc11)
	(at person2 loc13)
	(at person3 loc23)
	(at person4 loc22)
	(at person5 loc25)
	(at person6 loc5)
	(at person7 loc26)
	(at person8 loc3)
	(at person9 loc7)
	(at person10 loc8)
	(at person11 loc19)
	(at person12 loc18)
	(at person13 loc4)
	(at person14 loc24)
	(at person15 loc23)
	(at person16 loc4)
	(at person17 loc26)
	(at person18 loc23)
	(at person19 loc13)
	(at person20 loc15)
	(at person21 loc14)
	(at person22 loc22)
	(at person23 loc9)
	(at person24 loc6)
	(at person25 loc25)
	(at person26 loc16)
	(person-needs person1 food)
	(person-needs person1 medicine)
	(person-needs person2 food)
	(person-needs person3 medicine)
	(person-needs person4 food)
	(person-needs person5 food)
	(person-needs person5 medicine)
	(person-needs person6 food)
	(person-needs person7 food)
	(person-needs person8 food)
	(person-needs person11 food)
	(person-needs person12 food)
	(person-needs person14 food)
	(person-needs person16 food)
	(person-needs person17 food)
	(person-needs person18 food)
	(person-needs person18 medicine)
	(person-needs person19 food)
	(person-needs person19 medicine)
	(person-needs person20 food)
	(person-needs person22 food)
	(person-needs person22 medicine)
	(person-needs person23 medicine)
	(person-needs person25 food)
	(person-needs person25 medicine)
	(person-needs person26 food)
)
(:goal (and
	(at drone1 depot)
	(person-has person1 food)
	(person-has person1 medicine)
	(person-has person2 food)
	(person-has person3 medicine)
	(person-has person4 food)
	(person-has person5 food)
	(person-has person5 medicine)
	(person-has person6 food)
	(person-has person7 food)
	(person-has person8 food)
	(person-has person11 food)
	(person-has person12 food)
	(person-has person14 food)
	(person-has person16 food)
	(person-has person17 food)
	(person-has person18 food)
	(person-has person18 medicine)
	(person-has person19 food)
	(person-has person19 medicine)
	(person-has person20 food)
	(person-has person22 food)
	(person-has person22 medicine)
	(person-has person23 medicine)
	(person-has person25 food)
	(person-has person25 medicine)
	(person-has person26 food)
	))
)

; plan
1. (grab-arm1 drone1 crate20 depot)
   deleted: (arm1-free drone1) (at crate20 depot)
   added: (arm1-load drone1 crate20)
   goals met: 1 of 27
2. (grab-arm2 drone1 crate22 depot)
   deleted: (arm2-free drone1) (at crate22 depot)
   added: (arm2-load drone1 crate22)
   goals met: 1 of 27
3. (move-drone drone1 depot loc23)
   deleted: (at drone1 depot)
   added: (at drone1 loc23)
   goals met: 0 of 27
4. (deliver-arm2 drone1 person3 crate22 medicine loc23)
   deleted: (arm2-load drone1 crate22) (person-needs person3 medicine)
   added: (arm2-free drone1) (person-has person3 medicine)
   goals met: 1 of 27
5. (move-drone drone1 loc23 depot)
   deleted: (at drone1 loc23)
   added: (at drone1 depot)
   goals met: 2 of 27
6. (grab-arm2 drone1 crate24 depot)
   deleted: (arm2-free drone1) (at crate24 depot)
   added: (arm2-load drone1 crate24)
   goals met: 2 of 27
7. (move-drone drone1 depot loc25)
   deleted: (at drone1 depot)
   added: (at drone1 loc25)
   goals met: 1 of 27
8. (deliver-arm2 drone1 person5 crate24 medicine loc25)
   deleted: (arm2-load drone1 crate24) (person-needs person5 medicine)
   added: (arm2-free drone1) (person-has person5 medicine)
   goals met: 2 of 27
9. (move-drone drone1 loc25 loc2)
   deleted: (at drone1 loc25)
   added: (at drone1 loc2)
   goals met: 2 of 27
10. (move-drone drone1 loc2 depot)
   deleted: (at drone1 loc2)
   added: (at drone1 depot)
   goals met: 3 of 27
11. (grab-arm2 drone1 crate26 depot)
   deleted: (arm2-free drone1) (at crate26 depot)
   added: (arm2-load drone1 crate26)
   goals met: 3 of 27
12. (move-drone drone1 depot loc23)
   deleted: (at drone1 depot)
   added: (at drone1 loc23)
   goals met: 2 of 27
13. (deliver-arm2 drone1 person18 crate26 medicine loc23)
   deleted: (arm2-load drone1 crate26) (person-needs person18 medicine)
   added: (arm2-free drone1) (person-has person18 medicine)
   goals met: 3 of 27
14. (move-drone drone1 loc23 depot)
   deleted: (at drone1 loc23)
   added: (at drone1 depot)
   goals met: 4 of 27
15. (grab-arm2 drone1 crate25 depot)
   deleted: (arm2-free drone1) (at crate25 depot)
   added: (arm2-load drone1 crate25)
   goals met: 4 of 27
16. (move-drone drone1 depot loc13)
   deleted: (at drone1 depot)
   added: (at drone1 loc13)
   goals met: 3 of 27
17. (deliver-arm2 drone1 person19 crate25 medicine loc13)
   deleted: (arm2-load drone1 crate25) (person-needs person19 medicine)
   added: (arm2-free drone1) (person-has person19 medicine)
   goals met: 4 of 27
18. (move-drone drone1 loc13 depot)
   deleted: (at drone1 loc13)
   added: (at drone1 depot)
   goals met: 5 of 27
19. (grab-arm2 drone1 crate21 depot)
   deleted: (arm2-free drone1) (at crate21 depot)
   added: (arm2-load drone1 crate21)
   goals met: 5 of 27
20. (move-drone drone1 depot loc22)
   deleted: (at drone1 depot)
   added: (at drone1 loc22)
   goals met: 4 of 27
21. (deliver-arm2 drone1 person22 crate21 medicine loc22)
   deleted: (arm2-load drone1 crate21) (person-needs person22 medicine)
   added: (arm2-free drone1) (person-has person22 medicine)
   goals met: 5 of 27
22. (move-drone drone1 loc22 depot)
   deleted: (at drone1 loc22)
   added: (at drone1 depot)
   goals met: 6 of 27
23. (grab-arm2 drone1 crate19 depot)
   deleted: (arm2-free drone1) (at crate19 depot)
   added: (arm2-load drone1 crate19)
   goals met: 6 of 27
24. (move-drone drone1 depot loc9)
   deleted: (at drone1 depot)
   added: (at drone1 loc9)
   goals met: 5 of 27
25. (deliver-arm2 drone1 person23 crate19 medicine loc9)
   deleted: (arm2-load drone1 crate19) (person-needs person23 medicine)
   added: (arm2-free drone1) (person-has person23 medicine)
   goals met: 6 of 27
26. (move-drone drone1 loc9 depot)
   deleted: (at drone1 loc9)
   added: (at drone1 depot)
   goals met: 7 of 27
27. (grab-arm2 drone1 crate23 depot)
   deleted: (arm2-free drone1) (at crate23 depot)
   added: (arm2-load drone1 crate23)
   goals met: 7 of 27
28. (move-drone drone1 depot loc6)
   deleted: (at drone1 depot)
   added: (at drone1 loc6)
   goals met: 6 of 27
29. (move-drone drone1 loc6 loc25)
   deleted: (at drone1 loc6)
   added: (at drone1 loc25)
   goals met: 6 of 27
30. (deliver-arm2 drone1 person25 crate23 medicine loc25)
   deleted: (arm2-load drone1 crate23) (person-needs person25 medicine)
   added: (arm2-free drone1) (person-has person25 medicine)
   goals met: 7 of 27
31. (move-drone drone1 loc25 depot)
   deleted: (at drone1 loc25)
   added: (at drone1 depot)
   goals met: 8 of 27
32. (grab-arm2 drone1 crate9 depot)
   deleted: (arm2-free drone1) (at crate9 depot)
   added: (arm2-load drone1 crate9)
   goals met: 8 of 27
33. (move-drone drone1 depot loc11)
   deleted: (at drone1 depot)
   added: (at drone1 loc11)
   goals met: 7 of 27
34. (deliver-arm1 drone1 person1 crate20 medicine loc11)
   deleted: (arm1-load drone1 crate20) (person-needs person1 medicine)
   added: (arm1-free drone1) (person-has person1 medicine)
   goals met: 8 of 27
35. (move-drone drone1 loc11 loc26)
   deleted: (at drone1 loc11)
   added: (at drone1 loc26)
   goals met: 8 of 27
36. (deliver-arm2 drone1 person7 crate9 food loc26)
   deleted: (arm2-load drone1 crate9) (person-needs person7 food)
   added: (arm2-free drone1) (person-has person7 food)
   goals met: 9 of 27
37. (move-drone drone1 loc26 depot)
   deleted: (at drone1 loc26)
   added: (at drone1 depot)
   goals met: 10 of 27
38. (grab-arm1 drone1 crate16 depot)
   deleted: (arm1-free drone1) (at crate16 depot)
   added: (arm1-load drone1 crate16)
   goals met: 10 of 27
39. (move-drone drone1 depot loc3)
   deleted: (at drone1 depot)
   added: (at drone1 loc3)
   goals met: 9 of 27
40. (deliver-arm1 drone1 person8 crate16 food loc3)
   deleted: (arm1-load drone1 crate16) (person-needs person8 food)
   added: (arm1-free drone1) (person-has person8 food)
   goals met: 10 of 27
41. (move-drone drone1 loc3 loc7)
   deleted: (at drone1 loc3)
   added: (at drone1 loc7)
   goals met: 10 of 27
42. (move-drone drone1 loc7 depot)
   deleted: (at drone1 loc7)
   added: (at drone1 depot)
   goals met: 11 of 27
43. (grab-arm1 drone1 crate5 depot)
   deleted: (arm1-free drone1) (at crate5 depot)
   added: (arm1-load drone1 crate5)
   goals met: 11 of 27
44. (grab-arm2 drone1 crate14 depot)
   deleted: (arm2-free drone1) (at crate14 depot)
   added: (arm2-load drone1 crate14)
   goals met: 11 of 27
45. (move-drone drone1 depot loc19)
   deleted: (at drone1 depot)
   added: (at drone1 loc19)
   goals met: 10 of 27
46. (deliver-arm1 drone1 person11 crate5 food loc19)
   deleted: (arm1-load drone1 crate5) (person-needs person11 food)
   added: (arm1-free drone1) (person-has person11 food)
   goals met: 11 of 27
47. (move-drone drone1 loc19 loc6)
   deleted: (at drone1 loc19)
   added: (at drone1 loc6)
   goals met: 11 of 27
48. (move-drone drone1 loc6 loc18)
   deleted: (at drone1 loc6)
   added: (at drone1 loc18)
   goals met: 11 of 27
49. (deliver-arm2 drone1 person12 crate14 food loc18)
   deleted: (arm2-load drone1 crate14) (person-needs person12 food)
   added: (arm2-free drone1) (person-has person12 food)
   goals met: 12 of 27
50. (move-drone drone1 loc18 depot)
   deleted: (at drone1 loc18)
   added: (at drone1 depot)
   goals met: 13 of 27
51. (grab-arm2 drone1 crate17 depot)
   deleted: (arm2-free drone1) (at crate17 depot)
   added: (arm2-load drone1 crate17)
   goals met: 13 of 27
52. (grab-arm1 drone1 crate12 depot)
   deleted: (arm1-free drone1) (at crate12 depot)
   added: (arm1-load drone1 crate12)
   goals met: 13 of 27
53. (move-drone drone1 depot loc24)
   deleted: (at drone1 depot)
   added: (at drone1 loc24)
   goals met: 12 of 27
54. (deliver-arm2 drone1 person14 crate17 food loc24)
   deleted: (arm2-load drone1 crate17) (person-needs person14 food)
   added: (arm2-free drone1) (person-has person14 food)
   goals met: 13 of 27
55. (move-drone drone1 loc24 loc4)
   deleted: (at drone1 loc24)
   added: (at drone1 loc4)
   goals met: 13 of 27
56. (deliver-arm1 drone1 person16 crate12 food loc4)
   deleted: (arm1-load drone1 crate12) (person-needs person16 food)
   added: (arm1-free drone1) (person-has person16 food)
   goals met: 14 of 27
57. (move-drone drone1 loc4 depot)
   deleted: (at drone1 loc4)
   added: (at drone1 depot)
   goals met: 15 of 27
58. (grab-arm2 drone1 crate8 depot)
   deleted: (arm2-free drone1) (at crate8 depot)
   added: (arm2-load drone1 crate8)
   goals met: 15 of 27
59. (grab-arm1 drone1 crate13 depot)
   deleted: (arm1-free drone1) (at crate13 depot)
   added: (arm1-load drone1 crate13)
   goals met: 15 of 27
60. (move-drone drone1 depot loc26)
   deleted: (at drone1 depot)
   added: (at drone1 loc26)
   goals met: 14 of 27
61. (deliver-arm2 drone1 person17 crate8 food loc26)
   deleted: (arm2-load drone1 crate8) (person-needs person17 food)
   added: (arm2-free drone1) (person-has person17 food)
   goals met: 15 of 27
62. (move-drone drone1 loc26 loc23)
   deleted: (at drone1 loc26)
   added: (at drone1 loc23)
   goals met: 15 of 27
63. (deliver-arm1 drone1 person18 crate13 food loc23)
   deleted: (arm1-load drone1 crate13) (person-needs person18 food)
   added: (arm1-free drone1) (person-has person18 food)
   goals met: 16 of 27
64. (move-drone drone1 loc23 loc8)
   deleted: (at drone1 loc23)
   added: (at drone1 loc8)
   goals met: 16 of 27
65. (move-drone drone1 loc8 depot)
   deleted: (at drone1 loc8)
   added: (at drone1 depot)
   goals met: 17 of 27
66. (grab-arm1 drone1 crate2 depot)
   deleted: (arm1-free drone1) (at crate2 depot)
   added: (arm1-load drone1 crate2)
   goals met: 17 of 27
67. (move-drone drone1 depot loc13)
   deleted: (at drone1 depot)
   added: (at drone1 loc13)
   goals met: 16 of 27
68. (deliver-arm1 drone1 person2 crate2 food loc13)
   deleted: (arm1-load drone1 crate2) (person-needs person2 food)
   added: (arm1-free drone1) (person-has person2 food)
   goals met: 17 of 27
69. (move-drone drone1 loc13 depot)
   deleted: (at drone1 loc13)
   added: (at drone1 depot)
   goals met: 18 of 27
70. (grab-arm1 drone1 crate15 depot)
   deleted: (arm1-free drone1) (at crate15 depot)
   added: (arm1-load drone1 crate15)
   goals met: 18 of 27
71. (move-drone drone1 depot loc13)
   deleted: (at drone1 depot)
   added: (at drone1 loc13)
   goals met: 17 of 27
72. (deliver-arm1 drone1 person19 crate15 food loc13)
   deleted: (arm1-load drone1 crate15) (person-needs person19 food)
   added: (arm1-free drone1) (person-has person19 food)
   goals met: 18 of 27
73. (move-drone drone1 loc13 loc5)
   deleted: (at drone1 loc13)
   added: (at drone1 loc5)
   goals met: 18 of 27
74. (move-drone drone1 loc5 depot)
   deleted: (at drone1 loc5)
   added: (at drone1 depot)
   goals met: 19 of 27
75. (grab-arm1 drone1 crate1 depot)
   deleted: (arm1-free drone1) (at crate1 depot)
   added: (arm1-load drone1 crate1)
   goals met: 19 of 27
76. (move-drone drone1 depot loc5)
   deleted: (at drone1 depot)
   added: (at drone1 loc5)
   goals met: 18 of 27
77. (deliver-arm1 drone1 person6 crate1 food loc5)
   deleted: (arm1-load drone1 crate1) (person-needs person6 food)
   added: (arm1-free drone1) (person-has person6 food)
   goals met: 19 of 27
78. (move-drone drone1 loc5 depot)
   deleted: (at drone1 loc5)
   added: (at drone1 depot)
   goals met: 20 of 27
79. (grab-arm1 drone1 crate6 depot)
   deleted: (arm1-free drone1) (at crate6 depot)
   added: (arm1-load drone1 crate6)
   goals met: 20 of 27
80. (move-drone drone1 depot loc12)
   deleted: (at drone1 depot)
   added: (at drone1 loc12)
   goals met: 19 of 27
81. (move-drone drone1 loc12 loc15)
   deleted: (at drone1 loc12)
   added: (at drone1 loc15)
   goals met: 19 of 27
82. (deliver-arm1 drone1 person20 crate6 food loc15)
   deleted: (arm1-load drone1 crate6) (person-needs person20 food)
   added: (arm1-free drone1) (person-has person20 food)
   goals met: 20 of 27
83. (move-drone drone1 loc15 depot)
   deleted: (at drone1 loc15)
   added: (at drone1 depot)
   goals met: 21 of 27
84. (grab-arm1 drone1 crate10 depot)
   deleted: (arm1-free drone1) (at crate10 depot)
   added: (arm1-load drone1 crate10)
   goals met: 21 of 27
85. (move-drone drone1 depot loc22)
   deleted: (at drone1 depot)
   added: (at drone1 loc22)
   goals met: 20 of 27
86. (deliver-arm1 drone1 person22 crate10 food loc22)
   deleted: (arm1-load drone1 crate10) (person-needs person22 food)
   added: (arm1-free drone1) (person-has person22 food)
   goals met: 21 of 27
87. (move-drone drone1 loc22 depot)
   deleted: (at drone1 loc22)
   added: (at drone1 depot)
   goals met: 22 of 27
88. (grab-arm1 drone1 crate4 depot)
   deleted: (arm1-free drone1) (at crate4 depot)
   added: (arm1-load drone1 crate4)
   goals met: 22 of 27
89. (move-drone drone1 depot loc22)
   deleted: (at drone1 depot)
   added: (at drone1 loc22)
   goals met: 21 of 27
90. (deliver-arm1 drone1 person4 crate4 food loc22)
   deleted: (arm1-load drone1 crate4) (person-needs person4 food)
   added: (arm1-free drone1) (person-has person4 food)
   goals met: 22 of 27
91. (move-drone drone1 loc22 depot)
   deleted: (at drone1 loc22)
   added: (at drone1 depot)
   goals met: 23 of 27
92. (grab-arm1 drone1 crate3 depot)
   deleted: (arm1-free drone1) (at crate3 depot)
   added: (arm1-load drone1 crate3)
   goals met: 23 of 27
93. (move-drone drone1 depot loc25)
   deleted: (at drone1 depot)
   added: (at drone1 loc25)
   goals met: 22 of 27
94. (deliver-arm1 drone1 person5 crate3 food loc25)
   deleted: (arm1-load drone1 crate3) (person-needs person5 food)
   added: (arm1-free drone1) (person-has person5 food)
   goals met: 23 of 27
95. (move-drone drone1 loc25 depot)
   deleted: (at drone1 loc25)
   added: (at drone1 depot)
   goals met: 24 of 27
96. (grab-arm1 drone1 crate7 depot)
   deleted: (arm1-free drone1) (at crate7 depot)
   added: (arm1-load drone1 crate7)
   goals met: 24 of 27
97. (grab-arm2 drone1 crate18 depot)
   deleted: (arm2-free drone1) (at crate18 depot)
   added: (arm2-load drone1 crate18)
   goals met: 24 of 27
98. (move-drone drone1 depot loc25)
   deleted: (at drone1 depot)
   added: (at drone1 loc25)
   goals met: 23 of 27
99. (deliver-arm1 drone1 person25 crate7 food loc25)
   deleted: (arm1-load drone1 crate7) (person-needs person25 food)
   added: (arm1-free drone1) (person-has person25 food)
   goals met: 24 of 27
100. (move-drone drone1 loc25 loc11)
   deleted: (at drone1 loc25)
   added: (at drone1 loc11)
   goals met: 24 of 27
101. (deliver-arm2 drone1 person1 crate18 food loc11)
   deleted: (arm2-load drone1 crate18) (person-needs person1 food)
   added: (arm2-free drone1) (person-has person1 food)
   goals met: 25 of 27
102. (move-drone drone1 loc11 depot)
   deleted: (at drone1 loc11)
   added: (at drone1 depot)
   goals met: 26 of 27
103. (grab-arm2 drone1 crate11 depot)
   deleted: (arm2-free drone1) (at crate11 depot)
   added: (arm2-load drone1 crate11)
   goals met: 26 of 27
104. (move-drone drone1 depot loc16)
   deleted: (at drone1 depot)
   added: (at drone1 loc16)
   goals met: 25 of 27
105. (deliver-arm2 drone1 person26 crate11 food loc16)
   deleted: (arm2-load drone1 crate11) (person-needs person26 food)
   added: (arm2-free drone1) (person-has person26 food)
   goals met: 26 of 27
106. (move-drone drone1 loc16 depot)
   deleted: (at drone1 loc16)
   added: (at drone1 depot)
   goals met: 27 of 27
